# Titanic-Projekt  

<img src='https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/RMS_Titanic_3.jpg/375px-RMS_Titanic_3.jpg' width='250px;'/>

Die traruige Geschichte des Passagierschiffs ["Titanic"](https://de.wikipedia.org/wiki/RMS_Titanic) ist uns wohl bekannt.   
Wir wollen in diesem Notebook die Daten von Titanics Passigieren mit Hilfe von Pandas analysieren. Dazu haben wir die Daten in der Datei `titanic.csv` gespeichert.

In [1]:
import pandas as pd

Erstelle aus `titanic.csv` ein Dataframe.

In [30]:
df_titanic = pd.read_csv('C:/Users/OlhaIshchenko/Documents/Daten_Analyse/unterricht/csv_Datei/titanic.csv')

In [3]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Ermittle dann statistische Eckdaten des Dataframes, z.B. Lagemaße, Datentypen, Anzahl der Zeilen und Spalten ...

In [4]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Gibt es Datenlücken in Dataset? Wie kann man sie behandeln?

In [16]:
#
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [17]:
avg_age_male = df_titanic[df_titanic['Sex']=='male']['Age'].mean().astype(int)
avg_age_female = df_titanic[df_titanic['Sex']=='female']['Age'].mean().astype(int)

In [ ]:
df_titanic.loc[df_titanic['Sex']=='male', 'Age'] = df_titanic.loc[df_titanic['Sex']=='male', 'Age'].fillna(avg_age_male)
df_titanic.loc[df_titanic['Sex']=='female', 'Age']= df_titanic.loc[df_titanic['Sex']=='female', 'Age'].fillna(avg_age_female)

In [19]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
cabin_mode = df_titanic['Cabin'].mode()
cabin_mode

0        B96 B98
1    C23 C25 C27
2             G6
Name: Cabin, dtype: object

In [23]:
df_titanic['Cabin'] = df_titanic['Cabin'].fillna(df_titanic['Cabin'].mode()[0])

In [24]:
df_titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [27]:
embarked_mode = df_titanic['Embarked'].mode()
df_titanic['Embarked'] = df_titanic['Embarked'].fillna(df_titanic['Embarked'].mode()[0])

In [28]:
df_titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Gibt es kategorische Attribute in Dataset? Kann man diese in Zahlen umwandeln?

In [20]:
df_kat_v = df_titanic.select_dtypes(include='object')
df_kat_v.columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [ ]:
# df_titanic.loc[:, 'Sex'] = df_titanic['Sex'].replace({'male' : 0, 'female': 1})

C:\Users\OlhaIshchenko\AppData\Local\Temp\ipykernel_34436\671320501.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_titanic.loc[:, 'Sex'] = df_titanic['Sex'].replace({'male' : 0, 'female': 1})

In [ ]:
df_titanic_copy = df_titanic.copy()
df_titanic_copy.loc[df_titanic_copy['Sex'] =='male', 'Sex'] = 0
df_titanic_copy.loc[df_titanic_copy['Sex'] =='female', 'Sex'] = 1
df_titanic_copy.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
df_titanic_copy['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [8]:
#nan, S-1, C-2, Q-3
df_titanic_copy.loc[df_titanic_copy['Embarked'] =='S', 'Embarked'] = 1
df_titanic_copy.loc[df_titanic_copy['Embarked'] =='C', 'Embarked'] = 2
df_titanic_copy.loc[df_titanic_copy['Embarked'] =='Q', 'Embarked'] = 3

df_titanic_copy

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,2
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,1
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,1
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,1
889,890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,2
890,891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,3

Sind alle Datentypen in Dataset _richtig_ und für analytische Aufgaben geeignet? (Für nummerische Analysen müssen die Daten als Zahlen vorliegen, welche Spalte könnte man entsprechend umwandeln ? ) <br>
Zeicchenketten können unter anderem der `replace()`-Methode umgewandelt werden, in dem man jedes Vorkommen durch eine entsprechende Zahl ersetzt.

In [56]:
#
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [57]:
df_titanic_copy.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [64]:
df_titanic_copy2 = df_titanic.copy()

df_titanic_copy2.replace({'Sex': {'male': 0, 'female': 1}}, inplace=True)

df_titanic_copy2.replace({'Embarked': {'S': 1, 'C': 2, 'Q': 3}}, inplace=True)

df_titanic_copy2

C:\Users\OlhaIshchenko\AppData\Local\Temp\ipykernel_33772\3098787488.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_titanic_copy2.replace({'Sex': {'male': 0, 'female': 1}}, inplace=True)
C:\Users\OlhaIshchenko\AppData\Local\Temp\ipykernel_33772\3098787488.py:5: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_titanic_copy2.replace({'Embarked': {'S': 1, 'C': 2, 'Q': 3}}, inplace=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,2.0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,1.0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,1.0
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,1.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,1.0
889,890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,2.0
890,891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,3.0

In [66]:
df_titanic_copy2.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked       float64
dtype: object

Wie viele von Passagieren waren weiblich und wie viele männlich?

In [48]:
male_count = df_titanic[df_titanic['Sex']=='male']['PassengerId'].count()
male_count

np.int64(577)

In [49]:
female_count = df_titanic[df_titanic['Sex']=='female']['PassengerId'].count()
female_count

np.int64(314)

Wie ist der Prozentanteil der geretteten weiblichen Personen im Vergleich zu geretteten männlichen Personen?

In [51]:
male_survived = df_titanic[df_titanic['Sex']=='male'].groupby('Survived').count()['PassengerId'][1]
female_survived = df_titanic[df_titanic['Sex']=='female'].groupby('Survived').count()['PassengerId'][1]
print(male_survived/male_count*100, female_survived/female_count*100)

18.890814558058924 74.20382165605095

Wie ist der Durchschnittalter von weiblichen Personen, bzw. männlichen Passagieren?

In [32]:
df_titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

Happy Coding!